Table of Contents
 Interface IIdeaSegment3D
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Represents the line or arc segment of the element.
 Each element has just one segment, that can be of either line or arc type. See derived interfaces IIdeaLineSegment3D and IIdeaArcSegment3D.
public interface IIdeaSegment3D : IIdeaObject
Inherited Members
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 EndNode
End node of the segment. Returns the same value as end node of the owned element. Must not be equal to StartNode.
IIdeaNode EndNode { get; }
Property Value
IIdeaNode
 LocalCoordinateSystem
Local Coordinate System (LCS) of the segment. Only vector definition of the LCS is supported, so the instance of IdeaRS.OpenModel.Geometry3D.CoordSystemByVector must be returned. LCS only effects rotation of the segment, it does not modify on nodes' position.
CoordSystem LocalCoordinateSystem { get; }
Property Value
CoordSystem
 StartNode
Start node of the segment. Returns the same value as start node of the owned element. Must not be equal to EndNode.
IIdeaNode StartNode { get; }
Property Value
IIdeaNode
 Edit this page